{
  "seriesId": "jannah-series",
  "episodes": [
    {
      "id": "jannah-ep-01",
      "seriesId": "jannah-series",
      "episodeNumber": 1,
      "title": "The Gates of Jannah",
      "duration": "45:32",
      "youtubeUrl": "https://www.youtube.com/watch?v=example1",
      "publishedAt": "2025-01-15T00:00:00Z"
    },
    {
      "id": "jannah-ep-02",
      "seriesId": "jannah-series",
      "episodeNumber": 2,
      "title": "The Rivers of Paradise",
      "duration": "42:18",
      "youtubeUrl": "https://www.youtube.com/watch?v=example2",
      "publishedAt": "2025-01-16T00:00:00Z"
    },
    {
      "id": "jannah-ep-03",
      "seriesId": "jannah-series",
      "episodeNumber": 3,
      "title": "The People of Jannah",
      "duration": "48:55",
      "youtubeUrl": "https://www.youtube.com/watch?v=example3",
      "publishedAt": "2025-01-17T00:00:00Z"
    },
    {
      "id": "jannah-ep-04",
      "seriesId": "jannah-series",
      "episodeNumber": 4,
      "title": "The Highest Level: Al-Firdaws",
      "duration": "50:10",
      "youtubeUrl": "https://www.youtube.com/watch?v=example4",
      "publishedAt": "2025-01-18T00:00:00Z"
    },
    {
      "id": "jannah-ep-05",
      "seriesId": "jannah-series",
      "episodeNumber": 5,
      "title": "Seeing Allah in Jannah",
      "duration": "38:45",
      "youtubeUrl": "https://www.youtube.com/watch?v=example5",
      "publishedAt": "2025-01-19T00:00:00Z"
    }
  ],
  "companions": {
    "jannah-ep-01": {
      "episodeId": "jannah-ep-01",
      "generatedAt": "2025-01-20T00:00:00Z",
      "summary": "In this opening episode, Sheikh Omar Suleiman explores the eight gates of Jannah mentioned in Islamic tradition. Each gate is designated for those who excelled in specific acts of worship - from prayer and fasting to charity and jihad. The episode emphasizes that while Jannah has multiple gates, the believers should strive to be called from all of them, as Abu Bakr (RA) was told he would be.",
      "hadiths": [
        {
          "text": "In Paradise there are eight gates, among which is a gate called Ar-Rayyan, which none will enter but those who fast.",
          "source": "Sahih al-Bukhari 3257",
          "narrator": "Sahl ibn Sa'd (RA)",
          "context": "Sheikh Omar used this hadith to illustrate how fasting has its own special gate of entry into Paradise, encouraging consistent fasting beyond Ramadan."
        },
        {
          "text": "Whoever spends a pair in the way of Allah will be called from the gates of Paradise: 'O slave of Allah! This is good.' Those who are from the people of prayer will be called from the gate of prayer; those who are from the people of jihad will be called from the gate of jihad; those who are from the people of fasting will be called from the gate of Ar-Rayyan; and those who are from the people of charity will be called from the gate of charity.",
          "source": "Sahih al-Bukhari 3666",
          "narrator": "Abu Hurayrah (RA)",
          "context": "This hadith was the central narration of the episode, explaining the different gates and the conversation between the Prophet (SAW) and Abu Bakr (RA) about being called from all gates."
        }
      ],
      "verses": [
        {
          "arabic": "جَنَّاتُ عَدْنٍ يَدْخُلُونَهَا وَمَنْ صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ",
          "translation": "Gardens of perpetual residence; they will enter them with whoever were righteous among their fathers, their spouses and their descendants.",
          "reference": "Surah Ar-Ra'd 13:23",
          "context": "Sheikh Omar used this verse to highlight how Jannah reunites families, motivating listeners to help their families enter Paradise together."
        }
      ],
      "keyQuotes": [
        {
          "text": "Abu Bakr didn't just want to enter Jannah - he wanted to be called from every single gate. That's the ambition of a believer.",
          "timestamp": "12:45"
        },
        {
          "text": "Don't limit yourself to one act of worship. The doors of good are many, and Allah's mercy is vast.",
          "timestamp": "28:30"
        }
      ],
      "actionItems": [
        { "text": "Identify which gate of Jannah you'd most like to be called from and increase that worship", "category": "spiritual" },
        { "text": "Fast Mondays and Thursdays as Sunnah fasts to build connection with the gate of Ar-Rayyan", "category": "practical" },
        { "text": "Share one thing you learned about Jannah with a family member this week", "category": "social" },
        { "text": "Read about the descriptions of Jannah in Surah Ar-Rahman (55:46-78)", "category": "study" }
      ],
      "nextSteps": [
        "Watch Episode 2 to learn about the rivers that flow in Jannah",
        "Reflect on which acts of worship you want to strengthen",
        "Make dua asking Allah for Al-Firdaws, the highest level of Jannah"
      ],
      "themes": ["gates-of-jannah", "fasting", "charity", "ambition-in-worship", "abu-bakr"]
    },
    "jannah-ep-02": {
      "episodeId": "jannah-ep-02",
      "generatedAt": "2025-01-20T00:00:00Z",
      "summary": "Episode 2 dives into the rivers of Paradise - rivers of water, milk, honey, and wine that never spoil. Sheikh Omar explains how these are not merely physical pleasures but represent the perfection of everything we experience imperfectly in this world. The discussion covers how the Prophet (SAW) described the soil of Jannah, its fragrance, and the tree of Tuba.",
      "hadiths": [
        {
          "text": "In Jannah there is a tree under whose shade a rider can travel for a hundred years without covering it completely.",
          "source": "Sahih al-Bukhari 3251",
          "narrator": "Abu Hurayrah (RA)",
          "context": "Used to illustrate the incomprehensible scale of Paradise, challenging our limited imagination."
        }
      ],
      "verses": [
        {
          "arabic": "مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ فِيهَا أَنْهَارٌ مِّن مَّاءٍ غَيْرِ آسِنٍ وَأَنْهَارٌ مِّن لَّبَنٍ لَّمْ يَتَغَيَّرْ طَعْمُهُ",
          "translation": "The description of Paradise which the righteous are promised: therein are rivers of water unaltered, rivers of milk the taste of which never changes.",
          "reference": "Surah Muhammad 47:15",
          "context": "The central verse of this episode, with Sheikh Omar breaking down each of the four rivers mentioned."
        }
      ],
      "keyQuotes": [
        {
          "text": "Everything you love in this world is a sample - a fraction of what Allah has prepared for the believers.",
          "timestamp": "15:20"
        }
      ],
      "actionItems": [
        { "text": "When enjoying any blessing, say Alhamdulillah and remember it's a glimpse of Jannah", "category": "spiritual" },
        { "text": "Memorize the dua: Allahumma inni as'aluka al-Firdaws al-A'la min al-Jannah", "category": "practical" },
        { "text": "Discuss with a friend: what aspect of Jannah excites you most?", "category": "social" },
        { "text": "Read the tafsir of Surah Muhammad 47:15 for deeper understanding", "category": "study" }
      ],
      "nextSteps": [
        "Continue to Episode 3 to learn about the people of Jannah",
        "Reflect on how gratitude in this life connects to blessings in the next"
      ],
      "themes": ["rivers-of-jannah", "blessings", "gratitude", "scale-of-paradise"]
    }
  }
}
